GopalSaraf/Practicals/PSDL/include/proc/pic18f56q83.inc
// Register: DMAnSSAH
#define DMAnSSAH DMAnSSAH
DMAnSSAH                                 equ 00FAh
// bitfield definitions
DMAnSSAH_SSA_POSN                        equ 0000h
DMAnSSAH_SSA_POSITION                    equ 0000h
DMAnSSAH_SSA_SIZE                        equ 0008h
DMAnSSAH_SSA_LENGTH                      equ 0008h
DMAnSSAH_SSA_MASK                        equ 00FFh
DMAnSSAH_SSA8_POSN                       equ 0000h
DMAnSSAH_SSA8_POSITION                   equ 0000h
DMAnSSAH_SSA8_SIZE                       equ 0001h
DMAnSSAH_SSA8_LENGTH                     equ 0001h
DMAnSSAH_SSA8_MASK                       equ 0001h
DMAnSSAH_SSA9_POSN                       equ 0001h
DMAnSSAH_SSA9_POSITION                   equ 0001h
DMAnSSAH_SSA9_SIZE                       equ 0001h
DMAnSSAH_SSA9_LENGTH                     equ 0001h
DMAnSSAH_SSA9_MASK                       equ 0002h
DMAnSSAH_SSA10_POSN                      equ 0002h
DMAnSSAH_SSA10_POSITION                  equ 0002h
DMAnSSAH_SSA10_SIZE                      equ 0001h
DMAnSSAH_SSA10_LENGTH                    equ 0001h
DMAnSSAH_SSA10_MASK                      equ 0004h
DMAnSSAH_SSA11_POSN                      equ 0003h
DMAnSSAH_SSA11_POSITION                  equ 0003h
DMAnSSAH_SSA11_SIZE                      equ 0001h
DMAnSSAH_SSA11_LENGTH                    equ 0001h
DMAnSSAH_SSA11_MASK                      equ 0008h
DMAnSSAH_SSA12_POSN                      equ 0004h
DMAnSSAH_SSA12_POSITION                  equ 0004h
DMAnSSAH_SSA12_SIZE                      equ 0001h
DMAnSSAH_SSA12_LENGTH                    equ 0001h
DMAnSSAH_SSA12_MASK                      equ 0010h
DMAnSSAH_SSA13_POSN                      equ 0005h
DMAnSSAH_SSA13_POSITION                  equ 0005h
DMAnSSAH_SSA13_SIZE                      equ 0001h
DMAnSSAH_SSA13_LENGTH                    equ 0001h
DMAnSSAH_SSA13_MASK                      equ 0020h
DMAnSSAH_SSA14_POSN                      equ 0006h
DMAnSSAH_SSA14_POSITION                  equ 0006h
DMAnSSAH_SSA14_SIZE                      equ 0001h
DMAnSSAH_SSA14_LENGTH                    equ 0001h
DMAnSSAH_SSA14_MASK                      equ 0040h
DMAnSSAH_SSA15_POSN                      equ 0007h
DMAnSSAH_SSA15_POSITION                  equ 0007h
DMAnSSAH_SSA15_SIZE                      equ 0001h
DMAnSSAH_SSA15_LENGTH                    equ 0001h
DMAnSSAH_SSA15_MASK                      equ 0080h

// Register: DMAnSSAU
#define DMAnSSAU DMAnSSAU
DMAnSSAU                                 equ 00FBh
// bitfield definitions
DMAnSSAU_SSA_POSN                        equ 0000h
DMAnSSAU_SSA_POSITION                    equ 0000h
DMAnSSAU_SSA_SIZE                        equ 0008h
DMAnSSAU_SSA_LENGTH                      equ 0008h
DMAnSSAU_SSA_MASK                        equ 00FFh
DMAnSSAU_SSA16_POSN                      equ 0000h
DMAnSSAU_SSA16_POSITION                  equ 0000h
DMAnSSAU_SSA16_SIZE                      equ 0001h
DMAnSSAU_SSA16_LENGTH                    equ 0001h
DMAnSSAU_SSA16_MASK                      equ 0001h
DMAnSSAU_SSA17_POSN                      equ 0001h
DMAnSSAU_SSA17_POSITION                  equ 0001h
DMAnSSAU_SSA17_SIZE                      equ 0001h
DMAnSSAU_SSA17_LENGTH                    equ 0001h
DMAnSSAU_SSA17_MASK                      equ 0002h
DMAnSSAU_SSA18_POSN                      equ 0002h
DMAnSSAU_SSA18_POSITION                  equ 0002h
DMAnSSAU_SSA18_SIZE                      equ 0001h
DMAnSSAU_SSA18_LENGTH                    equ 0001h
DMAnSSAU_SSA18_MASK                      equ 0004h
DMAnSSAU_SSA19_POSN                      equ 0003h
DMAnSSAU_SSA19_POSITION                  equ 0003h
DMAnSSAU_SSA19_SIZE                      equ 0001h
DMAnSSAU_SSA19_LENGTH                    equ 0001h
DMAnSSAU_SSA19_MASK                      equ 0008h
DMAnSSAU_SSA20_POSN                      equ 0004h
DMAnSSAU_SSA20_POSITION                  equ 0004h
DMAnSSAU_SSA20_SIZE                      equ 0001h
DMAnSSAU_SSA20_LENGTH                    equ 0001h
DMAnSSAU_SSA20_MASK                      equ 0010h
DMAnSSAU_SSA21_POSN                      equ 0005h
DMAnSSAU_SSA21_POSITION                  equ 0005h
DMAnSSAU_SSA21_SIZE                      equ 0001h
DMAnSSAU_SSA21_LENGTH                    equ 0001h
DMAnSSAU_SSA21_MASK                      equ 0020h

// Register: DMAnCON0
#define DMAnCON0 DMAnCON0
DMAnCON0                                 equ 00FCh
// bitfield definitions
DMAnCON0_XIP_POSN                        equ 0000h
DMAnCON0_XIP_POSITION                    equ 0000h
DMAnCON0_XIP_SIZE                        equ 0001h
DMAnCON0_XIP_LENGTH                      equ 0001h
DMAnCON0_XIP_MASK                        equ 0001h
DMAnCON0_AIRQEN_POSN                     equ 0002h
DMAnCON0_AIRQEN_POSITION                 equ 0002h
DMAnCON0_AIRQEN_SIZE                     equ 0001h
DMAnCON0_AIRQEN_LENGTH                   equ 0001h
DMAnCON0_AIRQEN_MASK                     equ 0004h
DMAnCON0_DGO_POSN                        equ 0005h
DMAnCON0_DGO_POSITION                    equ 0005h
DMAnCON0_DGO_SIZE                        equ 0001h
DMAnCON0_DGO_LENGTH                      equ 0001h
DMAnCON0_DGO_MASK                        equ 0020h
DMAnCON0_SIRQEN_POSN                     equ 0006h
DMAnCON0_SIRQEN_POSITION                 equ 0006h
DMAnCON0_SIRQEN_SIZE                     equ 0001h
DMAnCON0_SIRQEN_LENGTH                   equ 0001h
DMAnCON0_SIRQEN_MASK                     equ 0040h
DMAnCON0_EN_POSN                         equ 0007h
DMAnCON0_EN_POSITION                     equ 0007h
DMAnCON0_EN_SIZE                         equ 0001h
DMAnCON0_EN_LENGTH                       equ 0001h
DMAnCON0_EN_MASK                         equ 0080h

// Register: DMAnCON1
#define DMAnCON1 DMAnCON1
DMAnCON1                                 equ 00FDh
// bitfield definitions
DMAnCON1_SSTP_POSN                       equ 0000h
DMAnCON1_SSTP_POSITION                   equ 0000h
DMAnCON1_SSTP_SIZE                       equ 0001h
DMAnCON1_SSTP_LENGTH                     equ 0001h
DMAnCON1_SSTP_MASK                       equ 0001h
DMAnCON1_SMODE_POSN                      equ 0001h
DMAnCON1_SMODE_POSITION                  equ 0001h
DMAnCON1_SMODE_SIZE                      equ 0002h
DMAnCON1_SMODE_LENGTH                    equ 0002h
DMAnCON1_SMODE_MASK                      equ 0006h
DMAnCON1_SMR_POSN                        equ 0003h
DMAnCON1_SMR_POSITION                    equ 0003h
DMAnCON1_SMR_SIZE                        equ 0002h
DMAnCON1_SMR_LENGTH                      equ 0002h
DMAnCON1_SMR_MASK                        equ 0018h
DMAnCON1_DSTP_POSN                       equ 0005h
DMAnCON1_DSTP_POSITION                   equ 0005h
DMAnCON1_DSTP_SIZE                       equ 0001h
DMAnCON1_DSTP_LENGTH                     equ 0001h
DMAnCON1_DSTP_MASK                       equ 0020h
DMAnCON1_DMODE_POSN                      equ 0006h
DMAnCON1_DMODE_POSITION                  equ 0006h
DMAnCON1_DMODE_SIZE                      equ 0002h
DMAnCON1_DMODE_LENGTH                    equ 0002h
DMAnCON1_DMODE_MASK                      equ 00C0h

