GopalSaraf/Practicals/PSDL/include/proc/pic18f56q83.inc
// Register: RA3PPS
#define RA3PPS RA3PPS
RA3PPS                                   equ 0204h
// bitfield definitions
RA3PPS_RA3PPS0_POSN                      equ 0000h
RA3PPS_RA3PPS0_POSITION                  equ 0000h
RA3PPS_RA3PPS0_SIZE                      equ 0001h
RA3PPS_RA3PPS0_LENGTH                    equ 0001h
RA3PPS_RA3PPS0_MASK                      equ 0001h
RA3PPS_RA3PPS1_POSN                      equ 0001h
RA3PPS_RA3PPS1_POSITION                  equ 0001h
RA3PPS_RA3PPS1_SIZE                      equ 0001h
RA3PPS_RA3PPS1_LENGTH                    equ 0001h
RA3PPS_RA3PPS1_MASK                      equ 0002h
RA3PPS_RA3PPS2_POSN                      equ 0002h
RA3PPS_RA3PPS2_POSITION                  equ 0002h
RA3PPS_RA3PPS2_SIZE                      equ 0001h
RA3PPS_RA3PPS2_LENGTH                    equ 0001h
RA3PPS_RA3PPS2_MASK                      equ 0004h
RA3PPS_RA3PPS3_POSN                      equ 0003h
RA3PPS_RA3PPS3_POSITION                  equ 0003h
RA3PPS_RA3PPS3_SIZE                      equ 0001h
RA3PPS_RA3PPS3_LENGTH                    equ 0001h
RA3PPS_RA3PPS3_MASK                      equ 0008h
RA3PPS_RA3PPS4_POSN                      equ 0004h
RA3PPS_RA3PPS4_POSITION                  equ 0004h
RA3PPS_RA3PPS4_SIZE                      equ 0001h
RA3PPS_RA3PPS4_LENGTH                    equ 0001h
RA3PPS_RA3PPS4_MASK                      equ 0010h
RA3PPS_RA3PPS5_POSN                      equ 0005h
RA3PPS_RA3PPS5_POSITION                  equ 0005h
RA3PPS_RA3PPS5_SIZE                      equ 0001h
RA3PPS_RA3PPS5_LENGTH                    equ 0001h
RA3PPS_RA3PPS5_MASK                      equ 0020h

// Register: RA4PPS
#define RA4PPS RA4PPS
RA4PPS                                   equ 0205h
// bitfield definitions
RA4PPS_RA4PPS0_POSN                      equ 0000h
RA4PPS_RA4PPS0_POSITION                  equ 0000h
RA4PPS_RA4PPS0_SIZE                      equ 0001h
RA4PPS_RA4PPS0_LENGTH                    equ 0001h
RA4PPS_RA4PPS0_MASK                      equ 0001h
RA4PPS_RA4PPS1_POSN                      equ 0001h
RA4PPS_RA4PPS1_POSITION                  equ 0001h
RA4PPS_RA4PPS1_SIZE                      equ 0001h
RA4PPS_RA4PPS1_LENGTH                    equ 0001h
RA4PPS_RA4PPS1_MASK                      equ 0002h
RA4PPS_RA4PPS2_POSN                      equ 0002h
RA4PPS_RA4PPS2_POSITION                  equ 0002h
RA4PPS_RA4PPS2_SIZE                      equ 0001h
RA4PPS_RA4PPS2_LENGTH                    equ 0001h
RA4PPS_RA4PPS2_MASK                      equ 0004h
RA4PPS_RA4PPS3_POSN                      equ 0003h
RA4PPS_RA4PPS3_POSITION                  equ 0003h
RA4PPS_RA4PPS3_SIZE                      equ 0001h
RA4PPS_RA4PPS3_LENGTH                    equ 0001h
RA4PPS_RA4PPS3_MASK                      equ 0008h
RA4PPS_RA4PPS4_POSN                      equ 0004h
RA4PPS_RA4PPS4_POSITION                  equ 0004h
RA4PPS_RA4PPS4_SIZE                      equ 0001h
RA4PPS_RA4PPS4_LENGTH                    equ 0001h
RA4PPS_RA4PPS4_MASK                      equ 0010h
RA4PPS_RA4PPS5_POSN                      equ 0005h
RA4PPS_RA4PPS5_POSITION                  equ 0005h
RA4PPS_RA4PPS5_SIZE                      equ 0001h
RA4PPS_RA4PPS5_LENGTH                    equ 0001h
RA4PPS_RA4PPS5_MASK                      equ 0020h

// Register: RA5PPS
#define RA5PPS RA5PPS
RA5PPS                                   equ 0206h
// bitfield definitions
RA5PPS_RA5PPS0_POSN                      equ 0000h
RA5PPS_RA5PPS0_POSITION                  equ 0000h
RA5PPS_RA5PPS0_SIZE                      equ 0001h
RA5PPS_RA5PPS0_LENGTH                    equ 0001h
RA5PPS_RA5PPS0_MASK                      equ 0001h
RA5PPS_RA5PPS1_POSN                      equ 0001h
RA5PPS_RA5PPS1_POSITION                  equ 0001h
RA5PPS_RA5PPS1_SIZE                      equ 0001h
RA5PPS_RA5PPS1_LENGTH                    equ 0001h
RA5PPS_RA5PPS1_MASK                      equ 0002h
RA5PPS_RA5PPS2_POSN                      equ 0002h
RA5PPS_RA5PPS2_POSITION                  equ 0002h
RA5PPS_RA5PPS2_SIZE                      equ 0001h
RA5PPS_RA5PPS2_LENGTH                    equ 0001h
RA5PPS_RA5PPS2_MASK                      equ 0004h
RA5PPS_RA5PPS3_POSN                      equ 0003h
RA5PPS_RA5PPS3_POSITION                  equ 0003h
RA5PPS_RA5PPS3_SIZE                      equ 0001h
RA5PPS_RA5PPS3_LENGTH                    equ 0001h
RA5PPS_RA5PPS3_MASK                      equ 0008h
RA5PPS_RA5PPS4_POSN                      equ 0004h
RA5PPS_RA5PPS4_POSITION                  equ 0004h
RA5PPS_RA5PPS4_SIZE                      equ 0001h
RA5PPS_RA5PPS4_LENGTH                    equ 0001h
RA5PPS_RA5PPS4_MASK                      equ 0010h
RA5PPS_RA5PPS5_POSN                      equ 0005h
RA5PPS_RA5PPS5_POSITION                  equ 0005h
RA5PPS_RA5PPS5_SIZE                      equ 0001h
RA5PPS_RA5PPS5_LENGTH                    equ 0001h
RA5PPS_RA5PPS5_MASK                      equ 0020h

// Register: RA6PPS
#define RA6PPS RA6PPS
RA6PPS                                   equ 0207h
// bitfield definitions
RA6PPS_RA6PPS0_POSN                      equ 0000h
RA6PPS_RA6PPS0_POSITION                  equ 0000h
RA6PPS_RA6PPS0_SIZE                      equ 0001h
RA6PPS_RA6PPS0_LENGTH                    equ 0001h
RA6PPS_RA6PPS0_MASK                      equ 0001h
RA6PPS_RA6PPS1_POSN                      equ 0001h
RA6PPS_RA6PPS1_POSITION                  equ 0001h
RA6PPS_RA6PPS1_SIZE                      equ 0001h
RA6PPS_RA6PPS1_LENGTH                    equ 0001h
RA6PPS_RA6PPS1_MASK                      equ 0002h
RA6PPS_RA6PPS2_POSN                      equ 0002h
RA6PPS_RA6PPS2_POSITION                  equ 0002h
RA6PPS_RA6PPS2_SIZE                      equ 0001h
RA6PPS_RA6PPS2_LENGTH                    equ 0001h
RA6PPS_RA6PPS2_MASK                      equ 0004h
RA6PPS_RA6PPS3_POSN                      equ 0003h
RA6PPS_RA6PPS3_POSITION                  equ 0003h
RA6PPS_RA6PPS3_SIZE                      equ 0001h
RA6PPS_RA6PPS3_LENGTH                    equ 0001h
RA6PPS_RA6PPS3_MASK                      equ 0008h
RA6PPS_RA6PPS4_POSN                      equ 0004h
RA6PPS_RA6PPS4_POSITION                  equ 0004h
RA6PPS_RA6PPS4_SIZE                      equ 0001h
RA6PPS_RA6PPS4_LENGTH                    equ 0001h
RA6PPS_RA6PPS4_MASK                      equ 0010h
RA6PPS_RA6PPS5_POSN                      equ 0005h
RA6PPS_RA6PPS5_POSITION                  equ 0005h
RA6PPS_RA6PPS5_SIZE                      equ 0001h
RA6PPS_RA6PPS5_LENGTH                    equ 0001h
RA6PPS_RA6PPS5_MASK                      equ 0020h

// Register: RA7PPS
#define RA7PPS RA7PPS
RA7PPS                                   equ 0208h
// bitfield definitions
RA7PPS_RA7PPS0_POSN                      equ 0000h
RA7PPS_RA7PPS0_POSITION                  equ 0000h
RA7PPS_RA7PPS0_SIZE                      equ 0001h
RA7PPS_RA7PPS0_LENGTH                    equ 0001h
RA7PPS_RA7PPS0_MASK                      equ 0001h
RA7PPS_RA7PPS1_POSN                      equ 0001h
RA7PPS_RA7PPS1_POSITION                  equ 0001h
RA7PPS_RA7PPS1_SIZE                      equ 0001h
RA7PPS_RA7PPS1_LENGTH                    equ 0001h
RA7PPS_RA7PPS1_MASK                      equ 0002h
RA7PPS_RA7PPS2_POSN                      equ 0002h
RA7PPS_RA7PPS2_POSITION                  equ 0002h
RA7PPS_RA7PPS2_SIZE                      equ 0001h
RA7PPS_RA7PPS2_LENGTH                    equ 0001h
RA7PPS_RA7PPS2_MASK                      equ 0004h
RA7PPS_RA7PPS3_POSN                      equ 0003h
RA7PPS_RA7PPS3_POSITION                  equ 0003h
RA7PPS_RA7PPS3_SIZE                      equ 0001h
RA7PPS_RA7PPS3_LENGTH                    equ 0001h
RA7PPS_RA7PPS3_MASK                      equ 0008h
RA7PPS_RA7PPS4_POSN                      equ 0004h
RA7PPS_RA7PPS4_POSITION                  equ 0004h
RA7PPS_RA7PPS4_SIZE                      equ 0001h
RA7PPS_RA7PPS4_LENGTH                    equ 0001h
RA7PPS_RA7PPS4_MASK                      equ 0010h
RA7PPS_RA7PPS5_POSN                      equ 0005h
RA7PPS_RA7PPS5_POSITION                  equ 0005h
RA7PPS_RA7PPS5_SIZE                      equ 0001h
RA7PPS_RA7PPS5_LENGTH                    equ 0001h
RA7PPS_RA7PPS5_MASK                      equ 0020h

// Register: RB0PPS
#define RB0PPS RB0PPS
RB0PPS                                   equ 0209h
// bitfield definitions
RB0PPS_RB0PPS0_POSN                      equ 0000h
RB0PPS_RB0PPS0_POSITION                  equ 0000h
RB0PPS_RB0PPS0_SIZE                      equ 0001h
RB0PPS_RB0PPS0_LENGTH                    equ 0001h
RB0PPS_RB0PPS0_MASK                      equ 0001h
RB0PPS_RB0PPS1_POSN                      equ 0001h
RB0PPS_RB0PPS1_POSITION                  equ 0001h
RB0PPS_RB0PPS1_SIZE                      equ 0001h
RB0PPS_RB0PPS1_LENGTH                    equ 0001h
RB0PPS_RB0PPS1_MASK                      equ 0002h
RB0PPS_RB0PPS2_POSN                      equ 0002h
RB0PPS_RB0PPS2_POSITION                  equ 0002h
RB0PPS_RB0PPS2_SIZE                      equ 0001h
RB0PPS_RB0PPS2_LENGTH                    equ 0001h
RB0PPS_RB0PPS2_MASK                      equ 0004h
RB0PPS_RB0PPS3_POSN                      equ 0003h
RB0PPS_RB0PPS3_POSITION                  equ 0003h
RB0PPS_RB0PPS3_SIZE                      equ 0001h
RB0PPS_RB0PPS3_LENGTH                    equ 0001h
RB0PPS_RB0PPS3_MASK                      equ 0008h
RB0PPS_RB0PPS4_POSN                      equ 0004h
RB0PPS_RB0PPS4_POSITION                  equ 0004h
RB0PPS_RB0PPS4_SIZE                      equ 0001h
RB0PPS_RB0PPS4_LENGTH                    equ 0001h
RB0PPS_RB0PPS4_MASK                      equ 0010h
RB0PPS_RB0PPS5_POSN                      equ 0005h
RB0PPS_RB0PPS5_POSITION                  equ 0005h
RB0PPS_RB0PPS5_SIZE                      equ 0001h
RB0PPS_RB0PPS5_LENGTH                    equ 0001h
RB0PPS_RB0PPS5_MASK                      equ 0020h

// Register: RB1PPS
#define RB1PPS RB1PPS
RB1PPS                                   equ 020Ah
// bitfield definitions
RB1PPS_RB1PPS0_POSN                      equ 0000h
RB1PPS_RB1PPS0_POSITION                  equ 0000h
RB1PPS_RB1PPS0_SIZE                      equ 0001h
RB1PPS_RB1PPS0_LENGTH                    equ 0001h
RB1PPS_RB1PPS0_MASK                      equ 0001h
RB1PPS_RB1PPS1_POSN                      equ 0001h
RB1PPS_RB1PPS1_POSITION                  equ 0001h
RB1PPS_RB1PPS1_SIZE                      equ 0001h
RB1PPS_RB1PPS1_LENGTH                    equ 0001h
RB1PPS_RB1PPS1_MASK                      equ 0002h
RB1PPS_RB1PPS2_POSN                      equ 0002h
RB1PPS_RB1PPS2_POSITION                  equ 0002h
RB1PPS_RB1PPS2_SIZE                      equ 0001h
RB1PPS_RB1PPS2_LENGTH                    equ 0001h
RB1PPS_RB1PPS2_MASK                      equ 0004h
RB1PPS_RB1PPS3_POSN                      equ 0003h
RB1PPS_RB1PPS3_POSITION                  equ 0003h
RB1PPS_RB1PPS3_SIZE                      equ 0001h
RB1PPS_RB1PPS3_LENGTH                    equ 0001h
RB1PPS_RB1PPS3_MASK                      equ 0008h
RB1PPS_RB1PPS4_POSN                      equ 0004h
RB1PPS_RB1PPS4_POSITION                  equ 0004h
RB1PPS_RB1PPS4_SIZE                      equ 0001h
RB1PPS_RB1PPS4_LENGTH                    equ 0001h
RB1PPS_RB1PPS4_MASK                      equ 0010h
RB1PPS_RB1PPS5_POSN                      equ 0005h
RB1PPS_RB1PPS5_POSITION                  equ 0005h
RB1PPS_RB1PPS5_SIZE                      equ 0001h
RB1PPS_RB1PPS5_LENGTH                    equ 0001h
RB1PPS_RB1PPS5_MASK                      equ 0020h

// Register: RB2PPS
#define RB2PPS RB2PPS
RB2PPS                                   equ 020Bh
// bitfield definitions
RB2PPS_RB2PPS0_POSN                      equ 0000h
RB2PPS_RB2PPS0_POSITION                  equ 0000h
RB2PPS_RB2PPS0_SIZE                      equ 0001h
RB2PPS_RB2PPS0_LENGTH                    equ 0001h
RB2PPS_RB2PPS0_MASK                      equ 0001h
RB2PPS_RB2PPS1_POSN                      equ 0001h
RB2PPS_RB2PPS1_POSITION                  equ 0001h
RB2PPS_RB2PPS1_SIZE                      equ 0001h
RB2PPS_RB2PPS1_LENGTH                    equ 0001h
RB2PPS_RB2PPS1_MASK                      equ 0002h
RB2PPS_RB2PPS2_POSN                      equ 0002h
RB2PPS_RB2PPS2_POSITION                  equ 0002h
RB2PPS_RB2PPS2_SIZE                      equ 0001h
RB2PPS_RB2PPS2_LENGTH                    equ 0001h
RB2PPS_RB2PPS2_MASK                      equ 0004h
RB2PPS_RB2PPS3_POSN                      equ 0003h
RB2PPS_RB2PPS3_POSITION                  equ 0003h
RB2PPS_RB2PPS3_SIZE                      equ 0001h
RB2PPS_RB2PPS3_LENGTH                    equ 0001h
RB2PPS_RB2PPS3_MASK                      equ 0008h
RB2PPS_RB2PPS4_POSN                      equ 0004h
RB2PPS_RB2PPS4_POSITION                  equ 0004h
RB2PPS_RB2PPS4_SIZE                      equ 0001h
RB2PPS_RB2PPS4_LENGTH                    equ 0001h
RB2PPS_RB2PPS4_MASK                      equ 0010h
RB2PPS_RB2PPS5_POSN                      equ 0005h
RB2PPS_RB2PPS5_POSITION                  equ 0005h
RB2PPS_RB2PPS5_SIZE                      equ 0001h
RB2PPS_RB2PPS5_LENGTH                    equ 0001h
RB2PPS_RB2PPS5_MASK                      equ 0020h

