GopalSaraf/Practicals/PSDL/include/proc/pic18f56q83.inc
// Register: CWG2PPS
#define CWG2PPS CWG2PPS
CWG2PPS                                  equ 025Ch
// bitfield definitions
CWG2PPS_PIN_POSN                         equ 0000h
CWG2PPS_PIN_POSITION                     equ 0000h
CWG2PPS_PIN_SIZE                         equ 0003h
CWG2PPS_PIN_LENGTH                       equ 0003h
CWG2PPS_PIN_MASK                         equ 0007h
CWG2PPS_PORT_POSN                        equ 0003h
CWG2PPS_PORT_POSITION                    equ 0003h
CWG2PPS_PORT_SIZE                        equ 0002h
CWG2PPS_PORT_LENGTH                      equ 0002h
CWG2PPS_PORT_MASK                        equ 0018h
CWG2PPS_CWGINPPS0_POSN                   equ 0000h
CWG2PPS_CWGINPPS0_POSITION               equ 0000h
CWG2PPS_CWGINPPS0_SIZE                   equ 0001h
CWG2PPS_CWGINPPS0_LENGTH                 equ 0001h
CWG2PPS_CWGINPPS0_MASK                   equ 0001h
CWG2PPS_CWGINPPS1_POSN                   equ 0001h
CWG2PPS_CWGINPPS1_POSITION               equ 0001h
CWG2PPS_CWGINPPS1_SIZE                   equ 0001h
CWG2PPS_CWGINPPS1_LENGTH                 equ 0001h
CWG2PPS_CWGINPPS1_MASK                   equ 0002h
CWG2PPS_CWGINPPS2_POSN                   equ 0002h
CWG2PPS_CWGINPPS2_POSITION               equ 0002h
CWG2PPS_CWGINPPS2_SIZE                   equ 0001h
CWG2PPS_CWGINPPS2_LENGTH                 equ 0001h
CWG2PPS_CWGINPPS2_MASK                   equ 0004h
CWG2PPS_CWGINPPS3_POSN                   equ 0003h
CWG2PPS_CWGINPPS3_POSITION               equ 0003h
CWG2PPS_CWGINPPS3_SIZE                   equ 0001h
CWG2PPS_CWGINPPS3_LENGTH                 equ 0001h
CWG2PPS_CWGINPPS3_MASK                   equ 0008h
CWG2PPS_CWGINPPS4_POSN                   equ 0004h
CWG2PPS_CWGINPPS4_POSITION               equ 0004h
CWG2PPS_CWGINPPS4_SIZE                   equ 0001h
CWG2PPS_CWGINPPS4_LENGTH                 equ 0001h
CWG2PPS_CWGINPPS4_MASK                   equ 0010h
CWG2PPS_CWG2INPPS_POSN                   equ 0000h
CWG2PPS_CWG2INPPS_POSITION               equ 0000h
CWG2PPS_CWG2INPPS_SIZE                   equ 0005h
CWG2PPS_CWG2INPPS_LENGTH                 equ 0005h
CWG2PPS_CWG2INPPS_MASK                   equ 001Fh
CWG2PPS_CWG2INPPS0_POSN                  equ 0000h
CWG2PPS_CWG2INPPS0_POSITION              equ 0000h
CWG2PPS_CWG2INPPS0_SIZE                  equ 0001h
CWG2PPS_CWG2INPPS0_LENGTH                equ 0001h
CWG2PPS_CWG2INPPS0_MASK                  equ 0001h
CWG2PPS_CWG2INPPS1_POSN                  equ 0001h
CWG2PPS_CWG2INPPS1_POSITION              equ 0001h
CWG2PPS_CWG2INPPS1_SIZE                  equ 0001h
CWG2PPS_CWG2INPPS1_LENGTH                equ 0001h
CWG2PPS_CWG2INPPS1_MASK                  equ 0002h
CWG2PPS_CWG2INPPS2_POSN                  equ 0002h
CWG2PPS_CWG2INPPS2_POSITION              equ 0002h
CWG2PPS_CWG2INPPS2_SIZE                  equ 0001h
CWG2PPS_CWG2INPPS2_LENGTH                equ 0001h
CWG2PPS_CWG2INPPS2_MASK                  equ 0004h
CWG2PPS_CWG2INPPS3_POSN                  equ 0003h
CWG2PPS_CWG2INPPS3_POSITION              equ 0003h
CWG2PPS_CWG2INPPS3_SIZE                  equ 0001h
CWG2PPS_CWG2INPPS3_LENGTH                equ 0001h
CWG2PPS_CWG2INPPS3_MASK                  equ 0008h
CWG2PPS_CWG2INPPS4_POSN                  equ 0004h
CWG2PPS_CWG2INPPS4_POSITION              equ 0004h
CWG2PPS_CWG2INPPS4_SIZE                  equ 0001h
CWG2PPS_CWG2INPPS4_LENGTH                equ 0001h
CWG2PPS_CWG2INPPS4_MASK                  equ 0010h
CWG2PPS_CWGINPPS_POSN                    equ 0000h
CWG2PPS_CWGINPPS_POSITION                equ 0000h
CWG2PPS_CWGINPPS_SIZE                    equ 0005h
CWG2PPS_CWGINPPS_LENGTH                  equ 0005h
CWG2PPS_CWGINPPS_MASK                    equ 001Fh

// Register: CWG3PPS
#define CWG3PPS CWG3PPS
CWG3PPS                                  equ 025Dh
// bitfield definitions
CWG3PPS_PIN_POSN                         equ 0000h
CWG3PPS_PIN_POSITION                     equ 0000h
CWG3PPS_PIN_SIZE                         equ 0003h
CWG3PPS_PIN_LENGTH                       equ 0003h
CWG3PPS_PIN_MASK                         equ 0007h
CWG3PPS_PORT_POSN                        equ 0003h
CWG3PPS_PORT_POSITION                    equ 0003h
CWG3PPS_PORT_SIZE                        equ 0002h
CWG3PPS_PORT_LENGTH                      equ 0002h
CWG3PPS_PORT_MASK                        equ 0018h
CWG3PPS_CWGINPPS0_POSN                   equ 0000h
CWG3PPS_CWGINPPS0_POSITION               equ 0000h
CWG3PPS_CWGINPPS0_SIZE                   equ 0001h
CWG3PPS_CWGINPPS0_LENGTH                 equ 0001h
CWG3PPS_CWGINPPS0_MASK                   equ 0001h
CWG3PPS_CWGINPPS1_POSN                   equ 0001h
CWG3PPS_CWGINPPS1_POSITION               equ 0001h
CWG3PPS_CWGINPPS1_SIZE                   equ 0001h
CWG3PPS_CWGINPPS1_LENGTH                 equ 0001h
CWG3PPS_CWGINPPS1_MASK                   equ 0002h
CWG3PPS_CWGINPPS2_POSN                   equ 0002h
CWG3PPS_CWGINPPS2_POSITION               equ 0002h
CWG3PPS_CWGINPPS2_SIZE                   equ 0001h
CWG3PPS_CWGINPPS2_LENGTH                 equ 0001h
CWG3PPS_CWGINPPS2_MASK                   equ 0004h
CWG3PPS_CWGINPPS3_POSN                   equ 0003h
CWG3PPS_CWGINPPS3_POSITION               equ 0003h
CWG3PPS_CWGINPPS3_SIZE                   equ 0001h
CWG3PPS_CWGINPPS3_LENGTH                 equ 0001h
CWG3PPS_CWGINPPS3_MASK                   equ 0008h
CWG3PPS_CWGINPPS4_POSN                   equ 0004h
CWG3PPS_CWGINPPS4_POSITION               equ 0004h
CWG3PPS_CWGINPPS4_SIZE                   equ 0001h
CWG3PPS_CWGINPPS4_LENGTH                 equ 0001h
CWG3PPS_CWGINPPS4_MASK                   equ 0010h
CWG3PPS_CWG3INPPS_POSN                   equ 0000h
CWG3PPS_CWG3INPPS_POSITION               equ 0000h
CWG3PPS_CWG3INPPS_SIZE                   equ 0005h
CWG3PPS_CWG3INPPS_LENGTH                 equ 0005h
CWG3PPS_CWG3INPPS_MASK                   equ 001Fh
CWG3PPS_CWG3INPPS0_POSN                  equ 0000h
CWG3PPS_CWG3INPPS0_POSITION              equ 0000h
CWG3PPS_CWG3INPPS0_SIZE                  equ 0001h
CWG3PPS_CWG3INPPS0_LENGTH                equ 0001h
CWG3PPS_CWG3INPPS0_MASK                  equ 0001h
CWG3PPS_CWG3INPPS1_POSN                  equ 0001h
CWG3PPS_CWG3INPPS1_POSITION              equ 0001h
CWG3PPS_CWG3INPPS1_SIZE                  equ 0001h
CWG3PPS_CWG3INPPS1_LENGTH                equ 0001h
CWG3PPS_CWG3INPPS1_MASK                  equ 0002h
CWG3PPS_CWG3INPPS2_POSN                  equ 0002h
CWG3PPS_CWG3INPPS2_POSITION              equ 0002h
CWG3PPS_CWG3INPPS2_SIZE                  equ 0001h
CWG3PPS_CWG3INPPS2_LENGTH                equ 0001h
CWG3PPS_CWG3INPPS2_MASK                  equ 0004h
CWG3PPS_CWG3INPPS3_POSN                  equ 0003h
CWG3PPS_CWG3INPPS3_POSITION              equ 0003h
CWG3PPS_CWG3INPPS3_SIZE                  equ 0001h
CWG3PPS_CWG3INPPS3_LENGTH                equ 0001h
CWG3PPS_CWG3INPPS3_MASK                  equ 0008h
CWG3PPS_CWG3INPPS4_POSN                  equ 0004h
CWG3PPS_CWG3INPPS4_POSITION              equ 0004h
CWG3PPS_CWG3INPPS4_SIZE                  equ 0001h
CWG3PPS_CWG3INPPS4_LENGTH                equ 0001h
CWG3PPS_CWG3INPPS4_MASK                  equ 0010h
CWG3PPS_CWGINPPS_POSN                    equ 0000h
CWG3PPS_CWGINPPS_POSITION                equ 0000h
CWG3PPS_CWGINPPS_SIZE                    equ 0005h
CWG3PPS_CWGINPPS_LENGTH                  equ 0005h
CWG3PPS_CWGINPPS_MASK                    equ 001Fh

// Register: MD1CARLPPS
#define MD1CARLPPS MD1CARLPPS
MD1CARLPPS                               equ 025Eh
// bitfield definitions
MD1CARLPPS_PIN_POSN                      equ 0000h
MD1CARLPPS_PIN_POSITION                  equ 0000h
MD1CARLPPS_PIN_SIZE                      equ 0003h
MD1CARLPPS_PIN_LENGTH                    equ 0003h
MD1CARLPPS_PIN_MASK                      equ 0007h
MD1CARLPPS_PORT_POSN                     equ 0003h
MD1CARLPPS_PORT_POSITION                 equ 0003h
MD1CARLPPS_PORT_SIZE                     equ 0002h
MD1CARLPPS_PORT_LENGTH                   equ 0002h
MD1CARLPPS_PORT_MASK                     equ 0018h
MD1CARLPPS_MDCARLPPS0_POSN               equ 0000h
MD1CARLPPS_MDCARLPPS0_POSITION           equ 0000h
MD1CARLPPS_MDCARLPPS0_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS0_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS0_MASK               equ 0001h
MD1CARLPPS_MDCARLPPS1_POSN               equ 0001h
MD1CARLPPS_MDCARLPPS1_POSITION           equ 0001h
MD1CARLPPS_MDCARLPPS1_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS1_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS1_MASK               equ 0002h
MD1CARLPPS_MDCARLPPS2_POSN               equ 0002h
MD1CARLPPS_MDCARLPPS2_POSITION           equ 0002h
MD1CARLPPS_MDCARLPPS2_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS2_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS2_MASK               equ 0004h
MD1CARLPPS_MDCARLPPS3_POSN               equ 0003h
MD1CARLPPS_MDCARLPPS3_POSITION           equ 0003h
MD1CARLPPS_MDCARLPPS3_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS3_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS3_MASK               equ 0008h
MD1CARLPPS_MDCARLPPS4_POSN               equ 0004h
MD1CARLPPS_MDCARLPPS4_POSITION           equ 0004h
MD1CARLPPS_MDCARLPPS4_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS4_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS4_MASK               equ 0010h
MD1CARLPPS_MDCARLPPS_POSN                equ 0000h
MD1CARLPPS_MDCARLPPS_POSITION            equ 0000h
MD1CARLPPS_MDCARLPPS_SIZE                equ 0005h
MD1CARLPPS_MDCARLPPS_LENGTH              equ 0005h
MD1CARLPPS_MDCARLPPS_MASK                equ 001Fh

// Register: MD1CARHPPS
#define MD1CARHPPS MD1CARHPPS
MD1CARHPPS                               equ 025Fh
// bitfield definitions
MD1CARHPPS_PIN_POSN                      equ 0000h
MD1CARHPPS_PIN_POSITION                  equ 0000h
MD1CARHPPS_PIN_SIZE                      equ 0003h
MD1CARHPPS_PIN_LENGTH                    equ 0003h
MD1CARHPPS_PIN_MASK                      equ 0007h
MD1CARHPPS_PORT_POSN                     equ 0003h
MD1CARHPPS_PORT_POSITION                 equ 0003h
MD1CARHPPS_PORT_SIZE                     equ 0002h
MD1CARHPPS_PORT_LENGTH                   equ 0002h
MD1CARHPPS_PORT_MASK                     equ 0018h
MD1CARHPPS_MDCARHPPS0_POSN               equ 0000h
MD1CARHPPS_MDCARHPPS0_POSITION           equ 0000h
MD1CARHPPS_MDCARHPPS0_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS0_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS0_MASK               equ 0001h
MD1CARHPPS_MDCARHPPS1_POSN               equ 0001h
MD1CARHPPS_MDCARHPPS1_POSITION           equ 0001h
MD1CARHPPS_MDCARHPPS1_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS1_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS1_MASK               equ 0002h
MD1CARHPPS_MDCARHPPS2_POSN               equ 0002h
MD1CARHPPS_MDCARHPPS2_POSITION           equ 0002h
MD1CARHPPS_MDCARHPPS2_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS2_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS2_MASK               equ 0004h
MD1CARHPPS_MDCARHPPS3_POSN               equ 0003h
MD1CARHPPS_MDCARHPPS3_POSITION           equ 0003h
MD1CARHPPS_MDCARHPPS3_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS3_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS3_MASK               equ 0008h
MD1CARHPPS_MDCARHPPS4_POSN               equ 0004h
MD1CARHPPS_MDCARHPPS4_POSITION           equ 0004h
MD1CARHPPS_MDCARHPPS4_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS4_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS4_MASK               equ 0010h
MD1CARHPPS_MDCARHPPS_POSN                equ 0000h
MD1CARHPPS_MDCARHPPS_POSITION            equ 0000h
MD1CARHPPS_MDCARHPPS_SIZE                equ 0005h
MD1CARHPPS_MDCARHPPS_LENGTH              equ 0005h
MD1CARHPPS_MDCARHPPS_MASK                equ 001Fh

// Register: MD1SRCPPS
#define MD1SRCPPS MD1SRCPPS
MD1SRCPPS                                equ 0260h
// bitfield definitions
MD1SRCPPS_PIN_POSN                       equ 0000h
MD1SRCPPS_PIN_POSITION                   equ 0000h
MD1SRCPPS_PIN_SIZE                       equ 0003h
MD1SRCPPS_PIN_LENGTH                     equ 0003h
MD1SRCPPS_PIN_MASK                       equ 0007h
MD1SRCPPS_PORT_POSN                      equ 0003h
MD1SRCPPS_PORT_POSITION                  equ 0003h
MD1SRCPPS_PORT_SIZE                      equ 0002h
MD1SRCPPS_PORT_LENGTH                    equ 0002h
MD1SRCPPS_PORT_MASK                      equ 0018h
MD1SRCPPS_MDSRCPPS0_POSN                 equ 0000h
MD1SRCPPS_MDSRCPPS0_POSITION             equ 0000h
MD1SRCPPS_MDSRCPPS0_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS0_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS0_MASK                 equ 0001h
MD1SRCPPS_MDSRCPPS1_POSN                 equ 0001h
MD1SRCPPS_MDSRCPPS1_POSITION             equ 0001h
MD1SRCPPS_MDSRCPPS1_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS1_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS1_MASK                 equ 0002h
MD1SRCPPS_MDSRCPPS2_POSN                 equ 0002h
MD1SRCPPS_MDSRCPPS2_POSITION             equ 0002h
MD1SRCPPS_MDSRCPPS2_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS2_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS2_MASK                 equ 0004h
MD1SRCPPS_MDSRCPPS3_POSN                 equ 0003h
MD1SRCPPS_MDSRCPPS3_POSITION             equ 0003h
MD1SRCPPS_MDSRCPPS3_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS3_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS3_MASK                 equ 0008h
MD1SRCPPS_MDSRCPPS4_POSN                 equ 0004h
MD1SRCPPS_MDSRCPPS4_POSITION             equ 0004h
MD1SRCPPS_MDSRCPPS4_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS4_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS4_MASK                 equ 0010h
MD1SRCPPS_MDSRCPPS_POSN                  equ 0000h
MD1SRCPPS_MDSRCPPS_POSITION              equ 0000h
MD1SRCPPS_MDSRCPPS_SIZE                  equ 0005h
MD1SRCPPS_MDSRCPPS_LENGTH                equ 0005h
MD1SRCPPS_MDSRCPPS_MASK                  equ 001Fh

