GopalSaraf/Practicals/PSDL/include/proc/pic18f56q83.inc
// Register: IVTAD
#define IVTAD IVTAD
IVTAD                                    equ 045Ah

// Register: IVTADL
#define IVTADL IVTADL
IVTADL                                   equ 045Ah
// bitfield definitions
IVTADL_AD0_POSN                          equ 0000h
IVTADL_AD0_POSITION                      equ 0000h
IVTADL_AD0_SIZE                          equ 0001h
IVTADL_AD0_LENGTH                        equ 0001h
IVTADL_AD0_MASK                          equ 0001h
IVTADL_AD1_POSN                          equ 0001h
IVTADL_AD1_POSITION                      equ 0001h
IVTADL_AD1_SIZE                          equ 0001h
IVTADL_AD1_LENGTH                        equ 0001h
IVTADL_AD1_MASK                          equ 0002h
IVTADL_AD2_POSN                          equ 0002h
IVTADL_AD2_POSITION                      equ 0002h
IVTADL_AD2_SIZE                          equ 0001h
IVTADL_AD2_LENGTH                        equ 0001h
IVTADL_AD2_MASK                          equ 0004h
IVTADL_AD3_POSN                          equ 0003h
IVTADL_AD3_POSITION                      equ 0003h
IVTADL_AD3_SIZE                          equ 0001h
IVTADL_AD3_LENGTH                        equ 0001h
IVTADL_AD3_MASK                          equ 0008h
IVTADL_AD4_POSN                          equ 0004h
IVTADL_AD4_POSITION                      equ 0004h
IVTADL_AD4_SIZE                          equ 0001h
IVTADL_AD4_LENGTH                        equ 0001h
IVTADL_AD4_MASK                          equ 0010h
IVTADL_AD5_POSN                          equ 0005h
IVTADL_AD5_POSITION                      equ 0005h
IVTADL_AD5_SIZE                          equ 0001h
IVTADL_AD5_LENGTH                        equ 0001h
IVTADL_AD5_MASK                          equ 0020h
IVTADL_AD6_POSN                          equ 0006h
IVTADL_AD6_POSITION                      equ 0006h
IVTADL_AD6_SIZE                          equ 0001h
IVTADL_AD6_LENGTH                        equ 0001h
IVTADL_AD6_MASK                          equ 0040h
IVTADL_AD7_POSN                          equ 0007h
IVTADL_AD7_POSITION                      equ 0007h
IVTADL_AD7_SIZE                          equ 0001h
IVTADL_AD7_LENGTH                        equ 0001h
IVTADL_AD7_MASK                          equ 0080h

// Register: IVTADH
#define IVTADH IVTADH
IVTADH                                   equ 045Bh
// bitfield definitions
IVTADH_AD8_POSN                          equ 0000h
IVTADH_AD8_POSITION                      equ 0000h
IVTADH_AD8_SIZE                          equ 0001h
IVTADH_AD8_LENGTH                        equ 0001h
IVTADH_AD8_MASK                          equ 0001h
IVTADH_AD9_POSN                          equ 0001h
IVTADH_AD9_POSITION                      equ 0001h
IVTADH_AD9_SIZE                          equ 0001h
IVTADH_AD9_LENGTH                        equ 0001h
IVTADH_AD9_MASK                          equ 0002h
IVTADH_AD10_POSN                         equ 0002h
IVTADH_AD10_POSITION                     equ 0002h
IVTADH_AD10_SIZE                         equ 0001h
IVTADH_AD10_LENGTH                       equ 0001h
IVTADH_AD10_MASK                         equ 0004h
IVTADH_AD11_POSN                         equ 0003h
IVTADH_AD11_POSITION                     equ 0003h
IVTADH_AD11_SIZE                         equ 0001h
IVTADH_AD11_LENGTH                       equ 0001h
IVTADH_AD11_MASK                         equ 0008h
IVTADH_AD12_POSN                         equ 0004h
IVTADH_AD12_POSITION                     equ 0004h
IVTADH_AD12_SIZE                         equ 0001h
IVTADH_AD12_LENGTH                       equ 0001h
IVTADH_AD12_MASK                         equ 0010h
IVTADH_AD13_POSN                         equ 0005h
IVTADH_AD13_POSITION                     equ 0005h
IVTADH_AD13_SIZE                         equ 0001h
IVTADH_AD13_LENGTH                       equ 0001h
IVTADH_AD13_MASK                         equ 0020h
IVTADH_AD14_POSN                         equ 0006h
IVTADH_AD14_POSITION                     equ 0006h
IVTADH_AD14_SIZE                         equ 0001h
IVTADH_AD14_LENGTH                       equ 0001h
IVTADH_AD14_MASK                         equ 0040h
IVTADH_AD15_POSN                         equ 0007h
IVTADH_AD15_POSITION                     equ 0007h
IVTADH_AD15_SIZE                         equ 0001h
IVTADH_AD15_LENGTH                       equ 0001h
IVTADH_AD15_MASK                         equ 0080h

// Register: IVTADU
#define IVTADU IVTADU
IVTADU                                   equ 045Ch
// bitfield definitions
IVTADU_AD16_POSN                         equ 0000h
IVTADU_AD16_POSITION                     equ 0000h
IVTADU_AD16_SIZE                         equ 0001h
IVTADU_AD16_LENGTH                       equ 0001h
IVTADU_AD16_MASK                         equ 0001h
IVTADU_AD17_POSN                         equ 0001h
IVTADU_AD17_POSITION                     equ 0001h
IVTADU_AD17_SIZE                         equ 0001h
IVTADU_AD17_LENGTH                       equ 0001h
IVTADU_AD17_MASK                         equ 0002h
IVTADU_AD18_POSN                         equ 0002h
IVTADU_AD18_POSITION                     equ 0002h
IVTADU_AD18_SIZE                         equ 0001h
IVTADU_AD18_LENGTH                       equ 0001h
IVTADU_AD18_MASK                         equ 0004h
IVTADU_AD19_POSN                         equ 0003h
IVTADU_AD19_POSITION                     equ 0003h
IVTADU_AD19_SIZE                         equ 0001h
IVTADU_AD19_LENGTH                       equ 0001h
IVTADU_AD19_MASK                         equ 0008h
IVTADU_AD20_POSN                         equ 0004h
IVTADU_AD20_POSITION                     equ 0004h
IVTADU_AD20_SIZE                         equ 0001h
IVTADU_AD20_LENGTH                       equ 0001h
IVTADU_AD20_MASK                         equ 0010h

// Register: IVTBASE
#define IVTBASE IVTBASE
IVTBASE                                  equ 045Dh

// Register: IVTBASEL
#define IVTBASEL IVTBASEL
IVTBASEL                                 equ 045Dh
// bitfield definitions
IVTBASEL_BASE0_POSN                      equ 0000h
IVTBASEL_BASE0_POSITION                  equ 0000h
IVTBASEL_BASE0_SIZE                      equ 0001h
IVTBASEL_BASE0_LENGTH                    equ 0001h
IVTBASEL_BASE0_MASK                      equ 0001h
IVTBASEL_BASE1_POSN                      equ 0001h
IVTBASEL_BASE1_POSITION                  equ 0001h
IVTBASEL_BASE1_SIZE                      equ 0001h
IVTBASEL_BASE1_LENGTH                    equ 0001h
IVTBASEL_BASE1_MASK                      equ 0002h
IVTBASEL_BASE2_POSN                      equ 0002h
IVTBASEL_BASE2_POSITION                  equ 0002h
IVTBASEL_BASE2_SIZE                      equ 0001h
IVTBASEL_BASE2_LENGTH                    equ 0001h
IVTBASEL_BASE2_MASK                      equ 0004h
IVTBASEL_BASE3_POSN                      equ 0003h
IVTBASEL_BASE3_POSITION                  equ 0003h
IVTBASEL_BASE3_SIZE                      equ 0001h
IVTBASEL_BASE3_LENGTH                    equ 0001h
IVTBASEL_BASE3_MASK                      equ 0008h
IVTBASEL_BASE4_POSN                      equ 0004h
IVTBASEL_BASE4_POSITION                  equ 0004h
IVTBASEL_BASE4_SIZE                      equ 0001h
IVTBASEL_BASE4_LENGTH                    equ 0001h
IVTBASEL_BASE4_MASK                      equ 0010h
IVTBASEL_BASE5_POSN                      equ 0005h
IVTBASEL_BASE5_POSITION                  equ 0005h
IVTBASEL_BASE5_SIZE                      equ 0001h
IVTBASEL_BASE5_LENGTH                    equ 0001h
IVTBASEL_BASE5_MASK                      equ 0020h
IVTBASEL_BASE6_POSN                      equ 0006h
IVTBASEL_BASE6_POSITION                  equ 0006h
IVTBASEL_BASE6_SIZE                      equ 0001h
IVTBASEL_BASE6_LENGTH                    equ 0001h
IVTBASEL_BASE6_MASK                      equ 0040h
IVTBASEL_BASE7_POSN                      equ 0007h
IVTBASEL_BASE7_POSITION                  equ 0007h
IVTBASEL_BASE7_SIZE                      equ 0001h
IVTBASEL_BASE7_LENGTH                    equ 0001h
IVTBASEL_BASE7_MASK                      equ 0080h

