GopalSaraf/Practicals/PSDL/include/proc/pic18f56q83.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 04FDh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 04FEh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 04FFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABAT                             BANKMASK(C1CONT), 3, b
#define ABD                              BANKMASK(I2C1CON2), 4, b
#define ACCM                             BANKMASK(CRCCON0), 4, b
#define ACCMOD                           BANKMASK(CRCCON0), 4, b
#define ACKCNT                           BANKMASK(I2C1CON1), 7, b
#define ACKDT                            BANKMASK(I2C1CON1), 6, b
#define ACKSTAT                          BANKMASK(I2C1CON1), 5, b
#define ACKT                             BANKMASK(I2C1CON1), 4, b
#define ACKT1IE                          BANKMASK(I2C1PIE), 6, b
#define ACKT1IF                          BANKMASK(I2C1PIR), 6, b
#define ACKTIE                           BANKMASK(I2C1PIE), 6, b
#define ACKTIF                           BANKMASK(I2C1PIR), 6, b
#define ACLR                             BANKMASK(ADCON2), 3, b
#define ACNT                             BANKMASK(I2C1CON2), 7, b
#define ACQ0                             BANKMASK(ADACQL), 0, b
#define ACQ1                             BANKMASK(ADACQL), 1, b
#define ACQ10                            BANKMASK(ADACQH), 2, b
#define ACQ11                            BANKMASK(ADACQH), 3, b
#define ACQ12                            BANKMASK(ADACQH), 4, b
#define ACQ2                             BANKMASK(ADACQL), 2, b
#define ACQ3                             BANKMASK(ADACQL), 3, b
#define ACQ4                             BANKMASK(ADACQL), 4, b
#define ACQ5                             BANKMASK(ADACQL), 5, b
#define ACQ6                             BANKMASK(ADACQL), 6, b
#define ACQ7                             BANKMASK(ADACQL), 7, b
#define ACQ8                             BANKMASK(ADACQH), 0, b
#define ACQ9                             BANKMASK(ADACQH), 1, b
#define ACSS                             BANKMASK(TBLPTRU), 5, a
#define ACT0                             BANKMASK(ADACT), 0, b
#define ACT1                             BANKMASK(ADACT), 1, b
#define ACT2                             BANKMASK(ADACT), 2, b
#define ACT3                             BANKMASK(ADACT), 3, b
#define ACT4                             BANKMASK(ADACT), 4, b
#define ACT5                             BANKMASK(ADACT), 5, b
#define ACTEN                            BANKMASK(ACTCON), 7, b
#define ACTIE                            BANKMASK(PIE1), 3, a
#define ACTIF                            BANKMASK(PIR1), 3, a
#define ACTIP                            BANKMASK(IPR1), 3, b
#define ACTLOCK                          BANKMASK(ACTCON), 3, b
#define ACTMD                            BANKMASK(PMD3), 7, b
#define ACTORS                           BANKMASK(ACTCON), 1, b
#define ACTUD                            BANKMASK(ACTCON), 6, b
#define AD0                              BANKMASK(IVTADL), 0, b
#define AD1                              BANKMASK(IVTADL), 1, b
#define AD10                             BANKMASK(IVTADH), 2, b
#define AD11                             BANKMASK(IVTADH), 3, b
#define AD12                             BANKMASK(IVTADH), 4, b
#define AD13                             BANKMASK(IVTADH), 5, b
#define AD14                             BANKMASK(IVTADH), 6, b
#define AD15                             BANKMASK(IVTADH), 7, b
#define AD16                             BANKMASK(IVTADU), 0, b
#define AD17                             BANKMASK(IVTADU), 1, b
#define AD18                             BANKMASK(IVTADU), 2, b
#define AD19                             BANKMASK(IVTADU), 3, b
#define AD2                              BANKMASK(IVTADL), 2, b
#define AD20                             BANKMASK(IVTADU), 4, b
#define AD3                              BANKMASK(IVTADL), 3, b
#define AD4                              BANKMASK(IVTADL), 4, b
#define AD5                              BANKMASK(IVTADL), 5, b
#define AD6                              BANKMASK(IVTADL), 6, b
#define AD7                              BANKMASK(IVTADL), 7, b
#define AD8                              BANKMASK(IVTADH), 0, b
#define AD9                              BANKMASK(IVTADH), 1, b
#define ADACC0                           BANKMASK(ADACCL), 0, b
#define ADACC1                           BANKMASK(ADACCL), 1, b
#define ADACC10                          BANKMASK(ADACCH), 2, b
#define ADACC11                          BANKMASK(ADACCH), 3, b
#define ADACC12                          BANKMASK(ADACCH), 4, b
#define ADACC13                          BANKMASK(ADACCH), 5, b
#define ADACC14                          BANKMASK(ADACCH), 6, b
#define ADACC15                          BANKMASK(ADACCH), 7, b
#define ADACC16                          BANKMASK(ADACCU), 0, b
#define ADACC17                          BANKMASK(ADACCU), 1, b
#define ADACC2                           BANKMASK(ADACCL), 2, b
#define ADACC3                           BANKMASK(ADACCL), 3, b
#define ADACC4                           BANKMASK(ADACCL), 4, b
#define ADACC5                           BANKMASK(ADACCL), 5, b
#define ADACC6                           BANKMASK(ADACCL), 6, b
#define ADACC7                           BANKMASK(ADACCL), 7, b
#define ADACC8                           BANKMASK(ADACCH), 0, b
#define ADACC9                           BANKMASK(ADACCH), 1, b
#define ADACLR                           BANKMASK(ADCON2), 3, b
#define ADACQ0                           BANKMASK(ADACQL), 0, b
#define ADACQ1                           BANKMASK(ADACQL), 1, b
#define ADACQ10                          BANKMASK(ADACQH), 2, b
#define ADACQ11                          BANKMASK(ADACQH), 3, b
#define ADACQ12                          BANKMASK(ADACQH), 4, b
#define ADACQ2                           BANKMASK(ADACQL), 2, b
#define ADACQ3                           BANKMASK(ADACQL), 3, b
#define ADACQ4                           BANKMASK(ADACQL), 4, b
#define ADACQ5                           BANKMASK(ADACQL), 5, b
#define ADACQ6                           BANKMASK(ADACQL), 6, b
#define ADACQ7                           BANKMASK(ADACQL), 7, b
#define ADACQ8                           BANKMASK(ADACQH), 0, b
#define ADACQ9                           BANKMASK(ADACQH), 1, b
#define ADACT0                           BANKMASK(ADACT), 0, b
#define ADACT1                           BANKMASK(ADACT), 1, b
#define ADACT2                           BANKMASK(ADACT), 2, b
#define ADACT3                           BANKMASK(ADACT), 3, b
#define ADACT4                           BANKMASK(ADACT), 4, b
#define ADACT5                           BANKMASK(ADACT), 5, b
#define ADACTPPS0                        BANKMASK(ADACTPPS), 0, b
#define ADACTPPS1                        BANKMASK(ADACTPPS), 1, b
#define ADACTPPS2                        BANKMASK(ADACTPPS), 2, b
#define ADACTPPS3                        BANKMASK(ADACTPPS), 3, b
#define ADACTPPS4                        BANKMASK(ADACTPPS), 4, b
#define ADAOV                            BANKMASK(ADSTAT), 7, b
#define ADCALC0                          BANKMASK(ADCON3), 4, b
#define ADCALC1                          BANKMASK(ADCON3), 5, b
#define ADCALC2                          BANKMASK(ADCON3), 6, b
#define ADCAP0                           BANKMASK(ADCAP), 0, b
#define ADCAP1                           BANKMASK(ADCAP), 1, b
#define ADCAP2                           BANKMASK(ADCAP), 2, b
#define ADCAP3                           BANKMASK(ADCAP), 3, b
#define ADCAP4                           BANKMASK(ADCAP), 4, b
#define ADCH1IE                          BANKMASK(PIE2), 0, a
#define ADCH1IF                          BANKMASK(PIR2), 0, a
#define ADCH1IP                          BANKMASK(IPR2), 0, b
#define ADCH2IE                          BANKMASK(PIE2), 1, a
#define ADCH2IF                          BANKMASK(PIR2), 1, a
#define ADCH2IP                          BANKMASK(IPR2), 1, b
#define ADCH3IE                          BANKMASK(PIE2), 2, a
#define ADCH3IF                          BANKMASK(PIR2), 2, a
#define ADCH3IP                          BANKMASK(IPR2), 2, b
#define ADCH4IE                          BANKMASK(PIE2), 3, a
#define ADCH4IF                          BANKMASK(PIR2), 3, a
#define ADCH4IP                          BANKMASK(IPR2), 3, b
#define ADCMD                            BANKMASK(PMD3), 5, b
#define ADCNT0                           BANKMASK(ADCNT), 0, b
#define ADCNT1                           BANKMASK(ADCNT), 1, b
#define ADCNT2                           BANKMASK(ADCNT), 2, b
#define ADCNT3                           BANKMASK(ADCNT), 3, b
#define ADCNT4                           BANKMASK(ADCNT), 4, b
#define ADCNT5                           BANKMASK(ADCNT), 5, b
#define ADCNT6                           BANKMASK(ADCNT), 6, b
#define ADCNT7                           BANKMASK(ADCNT), 7, b
#define ADCONT                           BANKMASK(ADCON0), 6, b
#define ADCPON                           BANKMASK(ADCPCON), 7, b
#define ADCPRDY                          BANKMASK(ADCPCON), 0, b
#define ADCRS0                           BANKMASK(ADCON2), 4, b
#define ADCRS1                           BANKMASK(ADCON2), 5, b
#define ADCRS2                           BANKMASK(ADCON2), 6, b
#define ADCS                             BANKMASK(ADCON0), 4, b
#define ADCS0                            BANKMASK(ADCLK), 0, b
#define ADCS1                            BANKMASK(ADCLK), 1, b
#define ADCS2                            BANKMASK(ADCLK), 2, b
#define ADCS3                            BANKMASK(ADCLK), 3, b
#define ADCS4                            BANKMASK(ADCLK), 4, b
#define ADCS5                            BANKMASK(ADCLK), 5, b
#define ADCSEN                           BANKMASK(ADCON0), 5, b
#define ADCTX0                           BANKMASK(ADCTX), 0, b
#define ADCTX1                           BANKMASK(ADCTX), 1, b
#define ADCTXSW                          BANKMASK(ADCTX), 7, b
#define ADDSEN                           BANKMASK(ADCON1), 0, b
#define ADERR0                           BANKMASK(ADERRL), 0, b
#define ADERR1                           BANKMASK(ADERRL), 1, b
#define ADERR10                          BANKMASK(ADERRH), 2, b
#define ADERR11                          BANKMASK(ADERRH), 3, b
#define ADERR12                          BANKMASK(ADERRH), 4, b
#define ADERR13                          BANKMASK(ADERRH), 5, b
#define ADERR14                          BANKMASK(ADERRH), 6, b
#define ADERR15                          BANKMASK(ADERRH), 7, b
#define ADERR2                           BANKMASK(ADERRL), 2, b
#define ADERR3                           BANKMASK(ADERRL), 3, b
#define ADERR4                           BANKMASK(ADERRL), 4, b
#define ADERR5                           BANKMASK(ADERRL), 5, b
#define ADERR6                           BANKMASK(ADERRL), 6, b
#define ADERR7                           BANKMASK(ADERRL), 7, b
#define ADERR8                           BANKMASK(ADERRH), 0, b
#define ADERR9                           BANKMASK(ADERRH), 1, b
#define ADFLTR0                          BANKMASK(ADFLTRL), 0, b
#define ADFLTR1                          BANKMASK(ADFLTRL), 1, b
#define ADFLTR10                         BANKMASK(ADFLTRH), 2, b
#define ADFLTR11                         BANKMASK(ADFLTRH), 3, b
#define ADFLTR12                         BANKMASK(ADFLTRH), 4, b
#define ADFLTR13                         BANKMASK(ADFLTRH), 5, b
#define ADFLTR14                         BANKMASK(ADFLTRH), 6, b
#define ADFLTR15                         BANKMASK(ADFLTRH), 7, b
#define ADFLTR2                          BANKMASK(ADFLTRL), 2, b
#define ADFLTR3                          BANKMASK(ADFLTRL), 3, b
#define ADFLTR4                          BANKMASK(ADFLTRL), 4, b
#define ADFLTR5                          BANKMASK(ADFLTRL), 5, b
#define ADFLTR6                          BANKMASK(ADFLTRL), 6, b
#define ADFLTR7                          BANKMASK(ADFLTRL), 7, b
#define ADFLTR8                          BANKMASK(ADFLTRH), 0, b
#define ADFLTR9                          BANKMASK(ADFLTRH), 1, b
#define ADFM0                            BANKMASK(ADCON0), 2, b
#define ADFVR0                           BANKMASK(FVRCON), 0, b
#define ADFVR1                           BANKMASK(FVRCON), 1, b
#define ADGO                             BANKMASK(ADCON0), 0, b
#define ADGPOL                           BANKMASK(ADCON1), 5, b
#define ADIE                             BANKMASK(PIE1), 2, a
#define ADIF                             BANKMASK(PIR1), 2, a
#define ADIP                             BANKMASK(IPR1), 2, b
#define ADIPEN                           BANKMASK(ADCON1), 6, b
#define ADLTH0                           BANKMASK(ADLTHL), 0, b
#define ADLTH1                           BANKMASK(ADLTHL), 1, b
#define ADLTH10                          BANKMASK(ADLTHH), 2, b
#define ADLTH11                          BANKMASK(ADLTHH), 3, b
#define ADLTH12                          BANKMASK(ADLTHH), 4, b
#define ADLTH13                          BANKMASK(ADLTHH), 5, b
#define ADLTH14                          BANKMASK(ADLTHH), 6, b
#define ADLTH15                          BANKMASK(ADLTHH), 7, b
#define ADLTH2                           BANKMASK(ADLTHL), 2, b
#define ADLTH3                           BANKMASK(ADLTHL), 3, b
#define ADLTH4                           BANKMASK(ADLTHL), 4, b
#define ADLTH5                           BANKMASK(ADLTHL), 5, b
#define ADLTH6                           BANKMASK(ADLTHL), 6, b
#define ADLTH7                           BANKMASK(ADLTHL), 7, b
#define ADLTH8                           BANKMASK(ADLTHH), 0, b
#define ADLTH9                           BANKMASK(ADLTHH), 1, b
#define ADLTHR                           BANKMASK(ADSTAT), 5, b
#define ADMATH                           BANKMASK(ADSTAT), 4, b
#define ADMD0                            BANKMASK(ADCON2), 0, b
#define ADMD1                            BANKMASK(ADCON2), 1, b
#define ADMD2                            BANKMASK(ADCON2), 2, b
#define ADNREF0                          BANKMASK(ADREF), 4, b
#define ADOEN                            BANKMASK(OSCEN), 2, b
#define ADON                             BANKMASK(ADCON0), 7, b
#define ADOR                             BANKMASK(OSCSTAT), 2, b
#define ADOV                             BANKMASK(ADSTAT), 7, b
#define ADPCH0                           BANKMASK(ADPCH), 0, b
#define ADPCH1                           BANKMASK(ADPCH), 1, b
#define ADPCH2                           BANKMASK(ADPCH), 2, b
#define ADPCH3                           BANKMASK(ADPCH), 3, b
#define ADPCH4                           BANKMASK(ADPCH), 4, b
#define ADPCH5                           BANKMASK(ADPCH), 5, b
#define ADPPOL                           BANKMASK(ADCON1), 7, b
#define ADPRE0                           BANKMASK(ADPREL), 0, b
#define ADPRE1                           BANKMASK(ADPREL), 1, b
#define ADPRE10                          BANKMASK(ADPREH), 2, b
#define ADPRE11                          BANKMASK(ADPREH), 3, b
#define ADPRE12                          BANKMASK(ADPREH), 4, b
#define ADPRE2                           BANKMASK(ADPREL), 2, b
#define ADPRE3                           BANKMASK(ADPREL), 3, b
#define ADPRE4                           BANKMASK(ADPREL), 4, b
#define ADPRE5                           BANKMASK(ADPREL), 5, b
#define ADPRE6                           BANKMASK(ADPREL), 6, b
#define ADPRE7                           BANKMASK(ADPREL), 7, b
#define ADPRE8                           BANKMASK(ADPREH), 0, b
#define ADPRE9                           BANKMASK(ADPREH), 1, b
#define ADPREF0                          BANKMASK(ADREF), 0, b
#define ADPREF1                          BANKMASK(ADREF), 1, b
#define ADPREV0                          BANKMASK(ADPREVL), 0, b
#define ADPREV1                          BANKMASK(ADPREVL), 1, b
#define ADPREV10                         BANKMASK(ADPREVH), 2, b
#define ADPREV11                         BANKMASK(ADPREVH), 3, b
#define ADPREV12                         BANKMASK(ADPREVH), 4, b
#define ADPREV13                         BANKMASK(ADPREVH), 5, b
#define ADPREV14                         BANKMASK(ADPREVH), 6, b
#define ADPREV15                         BANKMASK(ADPREVH), 7, b
#define ADPREV2                          BANKMASK(ADPREVL), 2, b
#define ADPREV3                          BANKMASK(ADPREVL), 3, b
#define ADPREV4                          BANKMASK(ADPREVL), 4, b
#define ADPREV5                          BANKMASK(ADPREVL), 5, b
#define ADPREV6                          BANKMASK(ADPREVL), 6, b
#define ADPREV7                          BANKMASK(ADPREVL), 7, b
#define ADPREV8                          BANKMASK(ADPREVH), 0, b
#define ADPREV9                          BANKMASK(ADPREVH), 1, b
#define ADPSIS                           BANKMASK(ADCON2), 7, b
#define ADR1IE                           BANKMASK(I2C1PIE), 3, b
#define ADR1IF                           BANKMASK(I2C1PIR), 3, b
#define ADRES0                           BANKMASK(ADRESL), 0, b
#define ADRES1                           BANKMASK(ADRESL), 1, b
#define ADRES10                          BANKMASK(ADRESH), 2, b
#define ADRES11                          BANKMASK(ADRESH), 3, b
#define ADRES12                          BANKMASK(ADRESH), 4, b
#define ADRES13                          BANKMASK(ADRESH), 5, b
#define ADRES14                          BANKMASK(ADRESH), 6, b
#define ADRES15                          BANKMASK(ADRESH), 7, b
#define ADRES2                           BANKMASK(ADRESL), 2, b
#define ADRES3                           BANKMASK(ADRESL), 3, b
#define ADRES4                           BANKMASK(ADRESL), 4, b
#define ADRES5                           BANKMASK(ADRESL), 5, b
#define ADRES6                           BANKMASK(ADRESL), 6, b
#define ADRES7                           BANKMASK(ADRESL), 7, b
#define ADRES8                           BANKMASK(ADRESH), 0, b
#define ADRES9                           BANKMASK(ADRESH), 1, b
#define ADRIE                            BANKMASK(I2C1PIE), 3, b
#define ADRIF                            BANKMASK(I2C1PIR), 3, b
#define ADRPT0                           BANKMASK(ADRPT), 0, b
#define ADRPT1                           BANKMASK(ADRPT), 1, b
#define ADRPT2                           BANKMASK(ADRPT), 2, b
#define ADRPT3                           BANKMASK(ADRPT), 3, b
#define ADRPT4                           BANKMASK(ADRPT), 4, b
#define ADRPT5                           BANKMASK(ADRPT), 5, b
#define ADRPT6                           BANKMASK(ADRPT), 6, b
#define ADRPT7                           BANKMASK(ADRPT), 7, b
#define ADSOI                            BANKMASK(ADCON3), 3, b
#define ADSTAT0                          BANKMASK(ADSTAT), 0, b
#define ADSTAT1                          BANKMASK(ADSTAT), 1, b
#define ADSTAT2                          BANKMASK(ADSTAT), 2, b
#define ADSTPT0                          BANKMASK(ADSTPTL), 0, b
#define ADSTPT1                          BANKMASK(ADSTPTL), 1, b
#define ADSTPT10                         BANKMASK(ADSTPTH), 2, b
#define ADSTPT11                         BANKMASK(ADSTPTH), 3, b
#define ADSTPT12                         BANKMASK(ADSTPTH), 4, b
#define ADSTPT13                         BANKMASK(ADSTPTH), 5, b
#define ADSTPT14                         BANKMASK(ADSTPTH), 6, b
#define ADSTPT15                         BANKMASK(ADSTPTH), 7, b
#define ADSTPT2                          BANKMASK(ADSTPTL), 2, b
#define ADSTPT3                          BANKMASK(ADSTPTL), 3, b
#define ADSTPT4                          BANKMASK(ADSTPTL), 4, b
#define ADSTPT5                          BANKMASK(ADSTPTL), 5, b
#define ADSTPT6                          BANKMASK(ADSTPTL), 6, b
#define ADSTPT7                          BANKMASK(ADSTPTL), 7, b
#define ADSTPT8                          BANKMASK(ADSTPTH), 0, b
#define ADSTPT9                          BANKMASK(ADSTPTH), 1, b
#define ADTIE                            BANKMASK(PIE2), 0, a
#define ADTIF                            BANKMASK(PIR2), 0, a
#define ADTIP                            BANKMASK(IPR2), 0, b
#define ADTMD0                           BANKMASK(ADCON3), 0, b
#define ADTMD1                           BANKMASK(ADCON3), 1, b
#define ADTMD2                           BANKMASK(ADCON3), 2, b
#define ADUTH0                           BANKMASK(ADUTHL), 0, b
#define ADUTH1                           BANKMASK(ADUTHL), 1, b
#define ADUTH10                          BANKMASK(ADUTHH), 2, b
#define ADUTH11                          BANKMASK(ADUTHH), 3, b
#define ADUTH12                          BANKMASK(ADUTHH), 4, b
#define ADUTH13                          BANKMASK(ADUTHH), 5, b
#define ADUTH14                          BANKMASK(ADUTHH), 6, b
#define ADUTH15                          BANKMASK(ADUTHH), 7, b
#define ADUTH2                           BANKMASK(ADUTHL), 2, b
#define ADUTH3                           BANKMASK(ADUTHL), 3, b
#define ADUTH4                           BANKMASK(ADUTHL), 4, b
#define ADUTH5                           BANKMASK(ADUTHL), 5, b
#define ADUTH6                           BANKMASK(ADUTHL), 6, b
#define ADUTH7                           BANKMASK(ADUTHL), 7, b
#define ADUTH8                           BANKMASK(ADUTHH), 0, b
#define ADUTH9                           BANKMASK(ADUTHH), 1, b
#define ADUTHR                           BANKMASK(ADSTAT), 6, b
#define AIRQ0                            BANKMASK(DMAnAIRQ), 0, b
#define AIRQ1                            BANKMASK(DMAnAIRQ), 1, b
#define AIRQ2                            BANKMASK(DMAnAIRQ), 2, b
#define AIRQ3                            BANKMASK(DMAnAIRQ), 3, b
#define AIRQ4                            BANKMASK(DMAnAIRQ), 4, b
#define AIRQ5                            BANKMASK(DMAnAIRQ), 5, b
#define AIRQ6                            BANKMASK(DMAnAIRQ), 6, b
#define AIRQ7                            BANKMASK(DMAnAIRQ), 7, b
#define AIRQEN                           BANKMASK(DMAnCON0), 2, b
#define ANSELA0                          BANKMASK(ANSELA), 0, b
#define ANSELA1                          BANKMASK(ANSELA), 1, b
#define ANSELA2                          BANKMASK(ANSELA), 2, b
#define ANSELA3                          BANKMASK(ANSELA), 3, b
#define ANSELA4                          BANKMASK(ANSELA), 4, b
#define ANSELA5                          BANKMASK(ANSELA), 5, b
#define ANSELA6                          BANKMASK(ANSELA), 6, b
#define ANSELA7                          BANKMASK(ANSELA), 7, b
#define ANSELB0                          BANKMASK(ANSELB), 0, b
#define ANSELB1                          BANKMASK(ANSELB), 1, b
#define ANSELB2                          BANKMASK(ANSELB), 2, b
#define ANSELB3                          BANKMASK(ANSELB), 3, b
#define ANSELB4                          BANKMASK(ANSELB), 4, b
#define ANSELB5                          BANKMASK(ANSELB), 5, b
#define ANSELB6                          BANKMASK(ANSELB), 6, b
#define ANSELB7                          BANKMASK(ANSELB), 7, b
#define ANSELC0                          BANKMASK(ANSELC), 0, b
#define ANSELC1                          BANKMASK(ANSELC), 1, b
#define ANSELC2                          BANKMASK(ANSELC), 2, b
