GopalSaraf/Practicals/PSDL/include/proc/pic18f56q83.inc
#define U3MD                             BANKMASK(PMD6), 5, b
#define U3MODE0                          BANKMASK(U3CON0), 0, b
#define U3MODE1                          BANKMASK(U3CON0), 1, b
#define U3MODE2                          BANKMASK(U3CON0), 2, b
#define U3ON                             BANKMASK(U3CON1), 7, b
#define U3PERIE                          BANKMASK(U3ERRIE), 6, b
#define U3PERIF                          BANKMASK(U3ERRIR), 6, b
#define U3RCIDL                          BANKMASK(U3FIFO), 3, b
#define U3RUNOVF                         BANKMASK(U3CON2), 7, b
#define U3RXBE                           BANKMASK(U3FIFO), 1, b
#define U3RXBF                           BANKMASK(U3FIFO), 0, b
#define U3RXBIMD                         BANKMASK(U3CON1), 3, b
#define U3RXBKIE                         BANKMASK(U3ERRIE), 2, b
#define U3RXBKIF                         BANKMASK(U3ERRIR), 2, b
#define U3RXEN                           BANKMASK(U3CON0), 4, b
#define U3RXFOIE                         BANKMASK(U3ERRIE), 1, b
#define U3RXFOIF                         BANKMASK(U3ERRIR), 1, b
#define U3RXIDL                          BANKMASK(U3FIFO), 3, b
#define U3RXIE                           BANKMASK(PIE9), 0, a
#define U3RXIF                           BANKMASK(PIR9), 0, a
#define U3RXIP                           BANKMASK(IPR9), 0, b
#define U3RXPOL                          BANKMASK(U3CON2), 6, b
#define U3RXPPS0                         BANKMASK(U3RXPPS), 0, b
#define U3RXPPS1                         BANKMASK(U3RXPPS), 1, b
#define U3RXPPS2                         BANKMASK(U3RXPPS), 2, b
#define U3RXPPS3                         BANKMASK(U3RXPPS), 3, b
#define U3RXPPS4                         BANKMASK(U3RXPPS), 4, b
#define U3RXPPS5                         BANKMASK(U3RXPPS), 5, b
#define U3SENDB                          BANKMASK(U3CON1), 0, b
#define U3STP0                           BANKMASK(U3CON2), 4, b
#define U3STP1                           BANKMASK(U3CON2), 5, b
#define U3STPMD                          BANKMASK(U3FIFO), 6, b
#define U3TXBE                           BANKMASK(U3FIFO), 5, b
#define U3TXBF                           BANKMASK(U3FIFO), 4, b
#define U3TXCIE                          BANKMASK(U3ERRIE), 0, b
#define U3TXCIF                          BANKMASK(U3ERRIR), 0, b
#define U3TXEN                           BANKMASK(U3CON0), 5, b
#define U3TXIE                           BANKMASK(PIE9), 1, a
#define U3TXIF                           BANKMASK(PIR9), 1, a
#define U3TXIP                           BANKMASK(IPR9), 1, b
#define U3TXMTIE                         BANKMASK(U3ERRIE), 7, b
#define U3TXMTIF                         BANKMASK(U3ERRIR), 7, b
#define U3TXPOL                          BANKMASK(U3CON2), 2, b
#define U3TXWRE                          BANKMASK(U3FIFO), 7, b
#define U3WUE                            BANKMASK(U3CON1), 4, b
#define U3WUIF                           BANKMASK(U3UIR), 7, b
#define U3XON                            BANKMASK(U3FIFO), 2, b
#define U4ABDEN                          BANKMASK(U4CON0), 6, b
#define U4ABDIE                          BANKMASK(U4UIR), 2, b
#define U4ABDIF                          BANKMASK(U4UIR), 6, b
#define U4ABDOVE                         BANKMASK(U4ERRIE), 5, b
#define U4ABDOVF                         BANKMASK(U4ERRIR), 5, b
#define U4BRGS                           BANKMASK(U4CON0), 7, b
#define U4BRKOVR                         BANKMASK(U4CON1), 1, b
#define U4CERIE                          BANKMASK(U4ERRIE), 4, b
#define U4CERIF                          BANKMASK(U4ERRIR), 4, b
#define U4CTSPPS0                        BANKMASK(U4CTSPPS), 0, b
#define U4CTSPPS1                        BANKMASK(U4CTSPPS), 1, b
#define U4CTSPPS2                        BANKMASK(U4CTSPPS), 2, b
#define U4CTSPPS3                        BANKMASK(U4CTSPPS), 3, b
#define U4CTSPPS4                        BANKMASK(U4CTSPPS), 4, b
#define U4EIE                            BANKMASK(PIE12), 2, a
#define U4EIF                            BANKMASK(PIR12), 2, a
#define U4EIP                            BANKMASK(IPR12), 2, b
#define U4FERIE                          BANKMASK(U4ERRIE), 3, b
#define U4FERIF                          BANKMASK(U4ERRIR), 3, b
#define U4FLO0                           BANKMASK(U4CON2), 0, b
#define U4FLO1                           BANKMASK(U4CON2), 1, b
#define U4IE                             BANKMASK(PIE12), 3, a
#define U4IF                             BANKMASK(PIR12), 3, a
#define U4IP                             BANKMASK(IPR12), 3, b
#define U4MD                             BANKMASK(PMD6), 6, b
#define U4MODE0                          BANKMASK(U4CON0), 0, b
#define U4MODE1                          BANKMASK(U4CON0), 1, b
#define U4MODE2                          BANKMASK(U4CON0), 2, b
#define U4ON                             BANKMASK(U4CON1), 7, b
#define U4PERIE                          BANKMASK(U4ERRIE), 6, b
#define U4PERIF                          BANKMASK(U4ERRIR), 6, b
#define U4RCIDL                          BANKMASK(U4FIFO), 3, b
#define U4RUNOVF                         BANKMASK(U4CON2), 7, b
#define U4RXBE                           BANKMASK(U4FIFO), 1, b
#define U4RXBF                           BANKMASK(U4FIFO), 0, b
#define U4RXBIMD                         BANKMASK(U4CON1), 3, b
#define U4RXBKIE                         BANKMASK(U4ERRIE), 2, b
#define U4RXBKIF                         BANKMASK(U4ERRIR), 2, b
#define U4RXEN                           BANKMASK(U4CON0), 4, b
#define U4RXFOIE                         BANKMASK(U4ERRIE), 1, b
#define U4RXFOIF                         BANKMASK(U4ERRIR), 1, b
#define U4RXIDL                          BANKMASK(U4FIFO), 3, b
#define U4RXIE                           BANKMASK(PIE12), 0, a
#define U4RXIF                           BANKMASK(PIR12), 0, a
#define U4RXIP                           BANKMASK(IPR12), 0, b
#define U4RXPOL                          BANKMASK(U4CON2), 6, b
#define U4RXPPS0                         BANKMASK(U4RXPPS), 0, b
#define U4RXPPS1                         BANKMASK(U4RXPPS), 1, b
#define U4RXPPS2                         BANKMASK(U4RXPPS), 2, b
#define U4RXPPS3                         BANKMASK(U4RXPPS), 3, b
#define U4RXPPS4                         BANKMASK(U4RXPPS), 4, b
#define U4SENDB                          BANKMASK(U4CON1), 0, b
#define U4STP0                           BANKMASK(U4CON2), 4, b
#define U4STP1                           BANKMASK(U4CON2), 5, b
#define U4STPMD                          BANKMASK(U4FIFO), 6, b
#define U4TXBE                           BANKMASK(U4FIFO), 5, b
#define U4TXBF                           BANKMASK(U4FIFO), 4, b
#define U4TXCIE                          BANKMASK(U4ERRIE), 0, b
#define U4TXCIF                          BANKMASK(U4ERRIR), 0, b
#define U4TXEN                           BANKMASK(U4CON0), 5, b
#define U4TXIE                           BANKMASK(PIE12), 1, a
#define U4TXIF                           BANKMASK(PIR12), 1, a
#define U4TXIP                           BANKMASK(IPR12), 1, b
#define U4TXMTIE                         BANKMASK(U4ERRIE), 7, b
#define U4TXMTIF                         BANKMASK(U4ERRIR), 7, b
#define U4TXPOL                          BANKMASK(U4CON2), 2, b
#define U4TXWRE                          BANKMASK(U4FIFO), 7, b
#define U4WUE                            BANKMASK(U4CON1), 4, b
#define U4WUIF                           BANKMASK(U4UIR), 7, b
#define U4XON                            BANKMASK(U4FIFO), 2, b
#define U5ABDEN                          BANKMASK(U5CON0), 6, b
#define U5ABDIE                          BANKMASK(U5UIR), 2, b
#define U5ABDIF                          BANKMASK(U5UIR), 6, b
#define U5ABDOVE                         BANKMASK(U5ERRIE), 5, b
#define U5ABDOVF                         BANKMASK(U5ERRIR), 5, b
#define U5BRGS                           BANKMASK(U5CON0), 7, b
#define U5BRKOVR                         BANKMASK(U5CON1), 1, b
#define U5CERIE                          BANKMASK(U5ERRIE), 4, b
#define U5CERIF                          BANKMASK(U5ERRIR), 4, b
#define U5CTSPPS0                        BANKMASK(U5CTSPPS), 0, b
#define U5CTSPPS1                        BANKMASK(U5CTSPPS), 1, b
#define U5CTSPPS2                        BANKMASK(U5CTSPPS), 2, b
#define U5CTSPPS3                        BANKMASK(U5CTSPPS), 3, b
#define U5CTSPPS4                        BANKMASK(U5CTSPPS), 4, b
#define U5CTSPPS5                        BANKMASK(U5CTSPPS), 5, b
#define U5EIE                            BANKMASK(PIE13), 2, a
#define U5EIF                            BANKMASK(PIR13), 2, a
#define U5EIP                            BANKMASK(IPR13), 2, b
#define U5FERIE                          BANKMASK(U5ERRIE), 3, b
#define U5FERIF                          BANKMASK(U5ERRIR), 3, b
#define U5FLO0                           BANKMASK(U5CON2), 0, b
#define U5FLO1                           BANKMASK(U5CON2), 1, b
#define U5IE                             BANKMASK(PIE13), 3, a
#define U5IF                             BANKMASK(PIR13), 3, a
#define U5IP                             BANKMASK(IPR13), 3, b
#define U5MD                             BANKMASK(PMD6), 7, b
#define U5MODE0                          BANKMASK(U5CON0), 0, b
#define U5MODE1                          BANKMASK(U5CON0), 1, b
#define U5MODE2                          BANKMASK(U5CON0), 2, b
#define U5ON                             BANKMASK(U5CON1), 7, b
#define U5PERIE                          BANKMASK(U5ERRIE), 6, b
#define U5PERIF                          BANKMASK(U5ERRIR), 6, b
#define U5RCIDL                          BANKMASK(U5FIFO), 3, b
#define U5RUNOVF                         BANKMASK(U5CON2), 7, b
#define U5RXBE                           BANKMASK(U5FIFO), 1, b
#define U5RXBF                           BANKMASK(U5FIFO), 0, b
#define U5RXBIMD                         BANKMASK(U5CON1), 3, b
#define U5RXBKIE                         BANKMASK(U5ERRIE), 2, b
#define U5RXBKIF                         BANKMASK(U5ERRIR), 2, b
#define U5RXEN                           BANKMASK(U5CON0), 4, b
#define U5RXFOIE                         BANKMASK(U5ERRIE), 1, b
#define U5RXFOIF                         BANKMASK(U5ERRIR), 1, b
#define U5RXIDL                          BANKMASK(U5FIFO), 3, b
#define U5RXIE                           BANKMASK(PIE13), 0, a
#define U5RXIF                           BANKMASK(PIR13), 0, a
#define U5RXIP                           BANKMASK(IPR13), 0, b
#define U5RXPOL                          BANKMASK(U5CON2), 6, b
#define U5RXPPS0                         BANKMASK(U5RXPPS), 0, b
#define U5RXPPS1                         BANKMASK(U5RXPPS), 1, b
#define U5RXPPS2                         BANKMASK(U5RXPPS), 2, b
#define U5RXPPS3                         BANKMASK(U5RXPPS), 3, b
#define U5RXPPS4                         BANKMASK(U5RXPPS), 4, b
#define U5RXPPS5                         BANKMASK(U5RXPPS), 5, b
#define U5SENDB                          BANKMASK(U5CON1), 0, b
#define U5STP0                           BANKMASK(U5CON2), 4, b
#define U5STP1                           BANKMASK(U5CON2), 5, b
#define U5STPMD                          BANKMASK(U5FIFO), 6, b
#define U5TXBE                           BANKMASK(U5FIFO), 5, b
#define U5TXBF                           BANKMASK(U5FIFO), 4, b
#define U5TXCIE                          BANKMASK(U5ERRIE), 0, b
#define U5TXCIF                          BANKMASK(U5ERRIR), 0, b
#define U5TXEN                           BANKMASK(U5CON0), 5, b
#define U5TXIE                           BANKMASK(PIE13), 1, a
#define U5TXIF                           BANKMASK(PIR13), 1, a
#define U5TXIP                           BANKMASK(IPR13), 1, b
#define U5TXMTIE                         BANKMASK(U5ERRIE), 7, b
#define U5TXMTIF                         BANKMASK(U5ERRIR), 7, b
#define U5TXPOL                          BANKMASK(U5CON2), 2, b
#define U5TXWRE                          BANKMASK(U5FIFO), 7, b
#define U5WUE                            BANKMASK(U5CON1), 4, b
#define U5WUIF                           BANKMASK(U5UIR), 7, b
#define U5XON                            BANKMASK(U5FIFO), 2, b
#define UTH0                             BANKMASK(ADUTHL), 0, b
#define UTH1                             BANKMASK(ADUTHL), 1, b
#define UTH10                            BANKMASK(ADUTHH), 2, b
#define UTH11                            BANKMASK(ADUTHH), 3, b
#define UTH12                            BANKMASK(ADUTHH), 4, b
#define UTH13                            BANKMASK(ADUTHH), 5, b
#define UTH14                            BANKMASK(ADUTHH), 6, b
#define UTH15                            BANKMASK(ADUTHH), 7, b
#define UTH2                             BANKMASK(ADUTHL), 2, b
#define UTH3                             BANKMASK(ADUTHL), 3, b
#define UTH4                             BANKMASK(ADUTHL), 4, b
#define UTH5                             BANKMASK(ADUTHL), 5, b
#define UTH6                             BANKMASK(ADUTHL), 6, b
#define UTH7                             BANKMASK(ADUTHL), 7, b
#define UTH8                             BANKMASK(ADUTHH), 0, b
#define UTH9                             BANKMASK(ADUTHH), 1, b
#define UTHR                             BANKMASK(ADSTAT), 6, b
#define VREGPM0                          BANKMASK(VREGCON), 0, b
#define VREGPM1                          BANKMASK(VREGCON), 1, b
#define WAKFIL                           BANKMASK(C1CONH), 0, b
#define WAKIE                            BANKMASK(C1INTT), 6, b
#define WAKIF                            BANKMASK(C1INTH), 6, b
#define WDTCS0                           BANKMASK(WDTCON1), 4, b
#define WDTCS1                           BANKMASK(WDTCON1), 5, b
#define WDTCS2                           BANKMASK(WDTCON1), 6, b
#define WDTPS0                           BANKMASK(WDTCON0), 1, b
#define WDTPS1                           BANKMASK(WDTCON0), 2, b
#define WDTPS2                           BANKMASK(WDTCON0), 3, b
#define WDTPS3                           BANKMASK(WDTCON0), 4, b
#define WDTPS4                           BANKMASK(WDTCON0), 5, b
#define WDTPSCNT0                        BANKMASK(WDTPSL), 0, b
#define WDTPSCNT1                        BANKMASK(WDTPSL), 1, b
#define WDTPSCNT10                       BANKMASK(WDTPSH), 2, b
#define WDTPSCNT11                       BANKMASK(WDTPSH), 3, b
#define WDTPSCNT12                       BANKMASK(WDTPSH), 4, b
#define WDTPSCNT13                       BANKMASK(WDTPSH), 5, b
#define WDTPSCNT14                       BANKMASK(WDTPSH), 6, b
#define WDTPSCNT15                       BANKMASK(WDTPSH), 7, b
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0, b
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1, b
#define WDTPSCNT2                        BANKMASK(WDTPSL), 2, b
#define WDTPSCNT3                        BANKMASK(WDTPSL), 3, b
#define WDTPSCNT4                        BANKMASK(WDTPSL), 4, b
#define WDTPSCNT5                        BANKMASK(WDTPSL), 5, b
#define WDTPSCNT6                        BANKMASK(WDTPSL), 6, b
#define WDTPSCNT7                        BANKMASK(WDTPSL), 7, b
#define WDTPSCNT8                        BANKMASK(WDTPSH), 0, b
#define WDTPSCNT9                        BANKMASK(WDTPSH), 1, b
#define WDTSEN                           BANKMASK(WDTCON0), 0, b
#define WDTSTATE                         BANKMASK(WDTTMR), 2, b
#define WDTTMR0                          BANKMASK(WDTTMR), 3, b
#define WDTTMR1                          BANKMASK(WDTTMR), 4, b
#define WDTTMR2                          BANKMASK(WDTTMR), 5, b
#define WDTTMR3                          BANKMASK(WDTTMR), 6, b
#define WDTTMR4                          BANKMASK(WDTTMR), 7, b
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0, b
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1, b
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2, b
#define WDTWV                            BANKMASK(PCON0), 5, a
#define WFT0                             BANKMASK(C1CONH), 1, b
#define WFT1                             BANKMASK(C1CONH), 2, b
#define WINDOW0                          BANKMASK(WDTCON1), 0, b
#define WINDOW1                          BANKMASK(WDTCON1), 1, b
#define WINDOW2                          BANKMASK(WDTCON1), 2, b
#define WPOL                             BANKMASK(SMT1CON0), 4, b
#define WPUA0                            BANKMASK(WPUA), 0, b
#define WPUA1                            BANKMASK(WPUA), 1, b
#define WPUA2                            BANKMASK(WPUA), 2, b
#define WPUA3                            BANKMASK(WPUA), 3, b
#define WPUA4                            BANKMASK(WPUA), 4, b
#define WPUA5                            BANKMASK(WPUA), 5, b
#define WPUA6                            BANKMASK(WPUA), 6, b
#define WPUA7                            BANKMASK(WPUA), 7, b
#define WPUB0                            BANKMASK(WPUB), 0, b
#define WPUB1                            BANKMASK(WPUB), 1, b
#define WPUB2                            BANKMASK(WPUB), 2, b
#define WPUB3                            BANKMASK(WPUB), 3, b
#define WPUB4                            BANKMASK(WPUB), 4, b
#define WPUB5                            BANKMASK(WPUB), 5, b
#define WPUB6                            BANKMASK(WPUB), 6, b
#define WPUB7                            BANKMASK(WPUB), 7, b
#define WPUC0                            BANKMASK(WPUC), 0, b
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WPUC6                            BANKMASK(WPUC), 6, b
#define WPUC7                            BANKMASK(WPUC), 7, b
#define WPUD0                            BANKMASK(WPUD), 0, b
#define WPUD1                            BANKMASK(WPUD), 1, b
#define WPUD2                            BANKMASK(WPUD), 2, b
#define WPUD3                            BANKMASK(WPUD), 3, b
#define WPUD4                            BANKMASK(WPUD), 4, b
#define WPUD5                            BANKMASK(WPUD), 5, b
#define WPUD6                            BANKMASK(WPUD), 6, b
#define WPUD7                            BANKMASK(WPUD), 7, b
#define WPUE0                            BANKMASK(WPUE), 0, b
#define WPUE1                            BANKMASK(WPUE), 1, b
#define WPUE2                            BANKMASK(WPUE), 2, b
#define WPUE3                            BANKMASK(WPUE), 3, b
#define WPUF0                            BANKMASK(WPUF), 0, b
#define WPUF1                            BANKMASK(WPUF), 1, b
#define WPUF2                            BANKMASK(WPUF), 2, b
#define WPUF3                            BANKMASK(WPUF), 3, b
#define WPUF4                            BANKMASK(WPUF), 4, b
#define WPUF5                            BANKMASK(WPUF), 5, b
#define WPUF6                            BANKMASK(WPUF), 6, b
#define WPUF7                            BANKMASK(WPUF), 7, b
#define WR1IE                            BANKMASK(I2C1PIE), 4, b
#define WR1IF                            BANKMASK(I2C1PIR), 4, b
#define WRERR                            BANKMASK(NVMCON1), 7, b
#define WRIE                             BANKMASK(I2C1PIE), 4, b
#define WRIF                             BANKMASK(I2C1PIR), 4, b
#define WS                               BANKMASK(SMT1STAT), 1, b
#define WSEL0                            BANKMASK(SMT1WIN), 0, b
#define WSEL1                            BANKMASK(SMT1WIN), 1, b
#define WSEL2                            BANKMASK(SMT1WIN), 2, b
#define WSEL3                            BANKMASK(SMT1WIN), 3, b
#define WSEL4                            BANKMASK(SMT1WIN), 4, b
#define XIP                              BANKMASK(DMAnCON0), 0, b
#define XOR0                             BANKMASK(CRCXORL), 0, b
#define XOR1                             BANKMASK(CRCXORL), 1, b
#define XOR10                            BANKMASK(CRCXORH), 2, b
#define XOR11                            BANKMASK(CRCXORH), 3, b
#define XOR12                            BANKMASK(CRCXORH), 4, b
#define XOR13                            BANKMASK(CRCXORH), 5, b
#define XOR14                            BANKMASK(CRCXORH), 6, b
#define XOR15                            BANKMASK(CRCXORH), 7, b
#define XOR16                            BANKMASK(CRCXORU), 0, b
#define XOR17                            BANKMASK(CRCXORU), 1, b
#define XOR18                            BANKMASK(CRCXORU), 2, b
#define XOR19                            BANKMASK(CRCXORU), 3, b
#define XOR2                             BANKMASK(CRCXORL), 2, b
#define XOR20                            BANKMASK(CRCXORU), 4, b
#define XOR21                            BANKMASK(CRCXORU), 5, b
#define XOR22                            BANKMASK(CRCXORU), 6, b
#define XOR23                            BANKMASK(CRCXORU), 7, b
#define XOR24                            BANKMASK(CRCXORT), 0, b
#define XOR25                            BANKMASK(CRCXORT), 1, b
#define XOR26                            BANKMASK(CRCXORT), 2, b
#define XOR27                            BANKMASK(CRCXORT), 3, b
#define XOR28                            BANKMASK(CRCXORT), 4, b
#define XOR29                            BANKMASK(CRCXORT), 5, b
#define XOR3                             BANKMASK(CRCXORL), 3, b
#define XOR30                            BANKMASK(CRCXORT), 6, b
#define XOR31                            BANKMASK(CRCXORT), 7, b
#define XOR4                             BANKMASK(CRCXORL), 4, b
#define XOR5                             BANKMASK(CRCXORL), 5, b
#define XOR6                             BANKMASK(CRCXORL), 6, b
#define XOR7                             BANKMASK(CRCXORL), 7, b
#define XOR8                             BANKMASK(CRCXORH), 0, b
#define XOR9                             BANKMASK(CRCXORH), 1, b
#define ZCDIE                            BANKMASK(PIE1), 1, a
#define ZCDIF                            BANKMASK(PIR1), 1, a
#define ZCDINTN                          BANKMASK(ZCDCON), 0, b
#define ZCDINTP                          BANKMASK(ZCDCON), 1, b
#define ZCDIP                            BANKMASK(IPR1), 1, b
#define ZCDMD                            BANKMASK(PMD3), 0, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define nBOR                             BANKMASK(PCON0), 0, a
#define nDONE                            BANKMASK(NVMCON0), 0, b
#define nMEMV                            BANKMASK(PCON1), 1, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nWDTWV                           BANKMASK(PCON0), 5, a

